[
    {
      "id": "bom_1_ Nephi_3_7",
      "front": {
        "Reference": "1 Nephi 3:7",
        "Doctrinal Topic": "Obedience"
      },
      "back": {
        "Key Phrase": "I will go and do",
        "Text": "And it came to pass that I, Nephi, said unto my father: I will go and do the things which the Lord hath commanded, for I know that the Lord inviteth no commandments unto the children of men, save he shall prepare a way whereby they may accomplish the thing which he commandeth them."
      }
    },
    {
      "id": "bom_1_ Nephi_17_45",
      "front": {
        "Reference": "1 Nephi 17:45",
        "Doctrinal Topic": "The Holy Ghost"
      },
      "back": {
        "Key Phrase": "Ye were past feeling",
        "Text": "And ye were past feeling, that ye could not feel his words; wherefore, he did speak unto you in a still small voice, but ye did esteem the as a thing of naught, and did harden your hearts against him."
      }
    },
    {
      "id": "bom_2_ Nephi_2_22_25",
      "front": {
        "Reference": "2 Nephi 2:22-25",
        "Doctrinal Topic": "The Fall of Adam and Eve"
      },
      "back": {
        "Key Phrase": "Adam fell that men might be; and men are, that they might have joy",
        "Text": "And now, behold, if Adam had not transgressed he would not have fallen, but he would have remained in the garden of Eden. And all things which were created must have remained in the same state in which they were after they were created; and they must have remained forever, and had no end.\nAnd they would have had no children; wherefore they would have remained in a state of innocence, having no joy, for they knew no misery; doing no good, for they knew no sin.\nBut behold, all things have been done in the wisdom of him who knoweth all things.\nAdam fell that men might be; and men are, that they might have joy.\nAnd the Messiah cometh in the fullness of time, that he may redeem the children of men from the fall. And because that they are redeemed from the fall they have become free forever, knowing good from evil; to act for themselves and not to be acted upon, save it be by the punishment of the law at the great and last day, according to the commandments which God hath given."
      }
    },
    {
      "id": "bom_2_ Nephi_2_27",
      "front": {
        "Reference": "2 Nephi 2:27",
        "Doctrinal Topic": "Agency"
      },
      "back": {
        "Key Phrase": "Free to choose liberty and eternal life ... or choose captivity and death",
        "Text": "Wherefore, men are free according to the flesh; and all things are expedient unto man. And ye are forbidden to partake of death; wherefore, look unto the great Mediator, and he layeth hold upon the greatness of the mercy unto the fulfilling of the law and the justice of him who created all things, and bringeth about the penitent unto the salvation of their souls.\nAnd now, my sons, remember, remember that it is upon the rock of our Redeemer, who is Christ, the Son of God, that ye must build your foundation; that when the devil shall send forth his mighty winds, yea, his shafts in the whirlwind, yea, when all his hail and his mighty storm shall beat upon you, it shall have no power to drag you down to the gulf of misery and endless wo, because of the rock upon which ye are built, which is a sure foundation, a foundation whereon if men build they cannot fall."
      }
    },
    {
      "id": "bom_2_ Nephi_9_28_29",
      "front": {
        "Reference": "2 Nephi 9:28-29",
        "Doctrinal Topic": "Knowledge and Wisdom"
      },
      "back": {
        "Key Phrase": "When they are learned they think they are wise ... but to be learned is good if they hearken unto the counsels of God",
        "Text": "O the cunning plans of the evil one! O the vainness, and the frailties, and the foolishness of men! When they are learned they think they are wise, and they hearken not unto the counsel of God, for they set it aside, supposing they know of themselves, wherefore, their wisdom is foolishness and it profiteth them not. And they shall perish.\nBut to be learned is good if they hearken unto the counsels of God."
      }
    },
    {
      "id": "bom_2_ Nephi_28_30",
      "front": {
        "Reference": "2 Nephi 28:30",
        "Doctrinal Topic": "Receiving Revelation"
      },
      "back": {
        "Key Phrase": "I shall give unto the children of men line upon line, precept upon precept",
        "Text": "For behold, thus saith the Lord God: I will give unto the children of men line upon line, precept upon precept, here a little and there a little; and blessed are those who hearken unto my precepts, and lend an ear unto my counsel, for they shall learn wisdom; for unto him that receiveth I will give more; and from them that shall say, We have enough, from them shall be taken away even that which they have."
      }
    },
    {
      "id": "bom_2_ Nephi_31_19_20",
      "front": {
        "Reference": "2 Nephi 31:19-20",
        "Doctrinal Topic": "Enduring to the End"
      },
      "back": {
        "Key Phrase": "Press forward with a steadfastness in Christ ... and endure to the end",
        "Text": "And now, my beloved brethren, after ye have gotten into this strait and narrow path, I would ask if all is done? Behold, I say unto you, Nay; for ye have not come thus far save it were by the word of Christ with unshaken faith in him, relying wholly upon the merits of him who is mighty to save.\nWherefore, ye must press forward with a steadfastness in Christ, having a perfect brightness of hope, and a love of God and of all men. Wherefore, if ye shall press forward, feasting upon the word of Christ, and endure to the end, behold, thus saith the Father: Ye shall have eternal life."
      }
    },
     {
      "id": "bom_2_ Nephi_32_3",
      "front": {
        "Reference": "2 Nephi 32:3",
        "Doctrinal Topic": "The Word of God"
      },
      "back": {
        "Key Phrase": "Feast upon the words of Christ",
        "Text": "Do ye not remember that I said unto you that when ye had received the Holy Ghost ye could speak with the tongue of angels? And now, how could ye speak with the tongue of angels save it were by the power of the Holy Ghost? Angels speak by the power of the Holy Ghost; wherefore, they speak the words of Christ. Wherefore, I said unto you, feast upon the words of Christ; for behold, the words of Christ will tell you all things what ye should do."
      }
    },
     {
      "id": "bom_2_ Nephi_32_8_9",
      "front": {
        "Reference": "2 Nephi 32:8-9",
        "Doctrinal Topic": "Prayer"
      },
      "back": {
        "Key Phrase": "Ye must pray always",
        "Text": "And now, my beloved brethren, I perceive that ye ponder still in your hearts; and it grieveth me that I must speak concerning this thing. For if ye would hearken unto the Spirit which teacheth a man to pray ye would know that ye must pray; for the evil spirit teacheth not a man to pray, but teacheth him that he must not pray.\nBut behold, I say unto you that ye must pray always, and not faint; that ye must not perform any thing unto the Lord save in the first place ye shall pray unto the Father in the name of Christ, that he will consecrate thy performance unto thee, that thy performance may be for the welfare of thy soul."
      }
    },
     {
      "id": "bom_Mosiah_2_17",
      "front": {
        "Reference": "Mosiah 2:17",
        "Doctrinal Topic": "Service"
      },
      "back": {
        "Key Phrase": "When ye are in the service of your fellow beings ye are only in the service of your God",
        "Text": "And behold, I tell you these things that ye may learn wisdom; that ye may learn that when ye are in the service of your fellow beings ye are only in the service of your God."
      }
    },
    {
      "id": "bom_Mosiah_3_19",
      "front": {
        "Reference": "Mosiah 3:19",
        "Doctrinal Topic": "The Natural Man"
      },
      "back": {
        "Key Phrase": "The natural man is an enemy to God",
        "Text": "For the natural man is an enemy to God, and has been from the fall of Adam, and will be, forever and ever, unless he yields to the enticings of the Holy Spirit, and putteth off the natural man and becometh a saint through the atonement of Christ the Lord, and becometh as a child, submissive, meek, humble, patient, full of love, willing to submit to all things which the Lord seeth fit to inflict upon him, even as a child doth submit to his father."
      }
    },
    {
      "id": "bom_Mosiah_4_9",
      "front": {
        "Reference": "Mosiah 4:9",
        "Doctrinal Topic": "Believing in God"
      },
      "back": {
        "Key Phrase": "Believe in God; believe that he is ... believe that he has all wisdom",
        "Text": "Believe in God; believe that he is, and that he created all things, both in heaven and in earth; believe that he has all wisdom, and all power, both in heaven and in earth; believe that man doth not comprehend all the things which the Lord can comprehend."
      }
    },
    {
      "id": "bom_Mosiah_18_8_10",
      "front": {
        "Reference": "Mosiah 18:8-10",
        "Doctrinal Topic": "Baptismal Covenant"
      },
      "back": {
        "Key Phrase": "Stand as witnesses of God",
        "Text": "And it came to pass that he said unto them: Behold, here are the waters of Mormon (for thus were they called) and now, as ye are desirous to come into the fold of God, and to be called his people, and are willing to bear one another’s burdens, that they may be light;\nYea, and are willing to mourn with those that mourn; yea, and comfort those that stand in need of comfort, and to stand as witnesses of God at all times and in all things, and in all places that ye may be in, even until death, that ye may be redeemed of God, and be numbered with those of the first resurrection, that ye may have eternal life—\nNow I say unto you, if this be the desire of your hearts, what have you against being baptized in the name of the Lord, as a witness before him that ye have entered into a covenant with him, that ye will serve him and keep his commandments, that he may pour out his Spirit more abundantly upon you?"
      }
    },
     {
      "id": "bom_Alma_7_11_12",
      "front": {
        "Reference": "Alma 7:11-12",
        "Doctrinal Topic": "The Atonement of Jesus Christ"
      },
      "back": {
        "Key Phrase": "He shall go forth, suffering pains and afflictions and temptations of every kind ... that he may know ... how to succor his people",
        "Text": "And he shall go forth, suffering pains and afflictions and temptations of every kind; and this that the word might be fulfilled which saith he will take upon him the pains and the sicknesses of his people.\nAnd he will take upon him death, that he may loose the bands of death which bind his people; and he will take upon him their infirmities, that his bowels may be filled with mercy, according to the flesh, that he may know according to the flesh how to succor his people according to their infirmities."
      }
    },
    {
      "id": "bom_Alma_32_21",
      "front": {
        "Reference": "Alma 32:21",
        "Doctrinal Topic": "Faith"
      },
      "back": {
        "Key Phrase": "Faith is not to have a perfect knowledge of things; therefore if ye have faith ye hope for things which are not seen, which are true",
        "Text": "And now as I said concerning faith—faith is not to have a perfect knowledge of things; therefore if ye have faith ye hope for things which are not seen, which are true."
      }
    },
     {
      "id": "bom_Alma_37_35",
      "front": {
        "Reference": "Alma 37:35",
        "Doctrinal Topic": "Chastity"
      },
      "back": {
        "Key Phrase": "Learn wisdom in thy youth; yea, learn in thy youth to keep the commandments of God",
        "Text": "O, remember, my son, and learn wisdom in thy youth; yea, learn in thy youth to keep the commandments of God."
      }
    },
    {
      "id": "bom_Alma_37_36",
      "front": {
        "Reference": "Alma 37:36",
        "Doctrinal Topic": "Prayer"
      },
      "back": {
        "Key Phrase": "Counsel with the Lord in all thy doings",
        "Text": "Yea, and cry unto God for all thy support; yea, let all thy doings be unto the Lord, and withersoever thou goest let it be in the Lord; yea, let all thy thoughts be directed unto the Lord; yea, let the affection of thy heart be placed upon the Lord forever. Counsel with the Lord in all thy doings, and he will direct thee for good; yea, when thou liest down at night lie down unto the Lord, that he may watch over you in your sleep; and when thou risest in the morning let thy heart be full of thanks unto God; and if ye do these things, ye shall be lifted up at the last day."
      }
    },
    {
      "id": "bom_Helaman_5_12",
      "front": {
        "Reference": "Helaman 5:12",
        "Doctrinal Topic": "Building on a Sure Foundation"
      },
      "back": {
        "Key Phrase": "It is upon the rock of our Redeemer, who is Christ, the Son of God, that ye must build your foundation",
        "Text": "And now, my sons, remember, remember that it is upon the rock of our Redeemer, who is Christ, the Son of God, that ye must build your foundation; that when the devil shall send forth his mighty winds, yea, his shafts in the whirlwind, yea, when all his hail and his mighty storm shall beat upon you, it shall have no power to drag you down to the gulf of misery and endless wo, because of the rock upon which ye are built, which is a sure foundation, a foundation whereon if men build they cannot fall."
      }
    },
    {
      "id": "bom_3_ Nephi_12_48",
      "front": {
        "Reference": "3 Nephi 12:48",
        "Doctrinal Topic": "Perfection"
      },
      "back": {
        "Key Phrase": "Be perfect even as I, or in other words, as my Father who is in heaven is perfect",
        "Text": "Therefore I would that ye should be perfect even as I, or in other words, as my Father who is in heaven is perfect."
      }
    },
    {
      "id": "bom_3_ Nephi_18_15_21",
      "front": {
        "Reference": "3 Nephi 18:15, 20-21",
        "Doctrinal Topic": "Prayer"
      },
      "back": {
        "Key Phrase": "Ye must watch and pray always",
        "Text": "Therefore, ye must always pray unto the Father in my name;\nAnd whatsoever ye shall ask the Father in my name, which is right, that will ye receive.\nAsk, and it shall be given unto you; seek, and ye shall find; knock, and it shall be opened unto you.\nFor everyone that asketh receiveth, and he that seeketh findeth, and unto him that knocketh it shall be opened."
      }
    },
    {
      "id": "bom_3_ Nephi_27_20",
      "front": {
        "Reference": "3 Nephi 27:20",
        "Doctrinal Topic": "Repentance and Baptism"
      },
      "back": {
        "Key Phrase": "Come unto me and be baptized",
        "Text": "Therefore, if ye will repent, and come unto me as a little child, and be baptized, be behold, ye shall be saved."
      }
    },
    {
      "id": "bom_Ether_12_6",
      "front": {
        "Reference": "Ether 12:6",
        "Doctrinal Topic": "Faith"
      },
      "back": {
        "Key Phrase": "Dispute not because ye see not, for ye receive no witness until after the trial of your faith",
        "Text": "And now, I would speak somewhat concerning these things; for after that ye have received a witness that ye can receive no witness until after the trial of your faith."
      }
    },
    {
      "id": "bom_Ether_12_27",
      "front": {
        "Reference": "Ether 12:27",
        "Doctrinal Topic": "Weakness Made Strong"
      },
      "back": {
        "Key Phrase": "If men come unto me I will show unto them their weakness ... and my grace is sufficient for all men ... and if they humble themselves ... then will I make weak things become strong unto them",
        "Text": "And if men come unto me I will show unto them their weakness. I give unto men weakness that they may be humble; and my grace is sufficient for all men that humble themselves before me; for if they humble themselves before me, and have faith in me, then will I make weak things become strong unto them."
      }
    },
     {
      "id": "bom_Moroni_7_45_48",
      "front": {
        "Reference": "Moroni 7:45, 47-48",
        "Doctrinal Topic": "Charity"
      },
      "back": {
        "Key Phrase": "Charity is the pure love of Christ",
        "Text": "And charity suffereth long, and is kind, and envieth not, and is not puffed up, seeketh not her own, is not easily provoked, thinketh no evil, and rejoiceth not in iniquity but rejoiceth in the truth, beareth all things, believeth all things, hopeth all things, endureth all things.\nAnd charity is the pure love of Christ, and it endureth forever; and whoso is found possessed of it at the last day, it shall be well with him.\nWherefore, my beloved brethren, pray unto the Father with all the energy of heart, that ye may be filled with this love, which he hath bestowed upon all true followers of his Son, Jesus Christ; that ye may become the sons of God; that when he shall appear we shall be like him, for we shall see him as he is; that we may have this hope; that we may be purified even as he is pure. Amen."
      }
    },
    {
      "id": "bom_Moroni_10_4_5",
      "front": {
        "Reference": "Moroni 10:4-5",
        "Doctrinal Topic": "The Book of Mormon"
      },
      "back": {
        "Key Phrase": "By the power of the Holy Ghost ye may know the truth of all things",
        "Text": "And when ye shall receive these things, I would exhort you that ye would ask God, the Eternal Father, in the name of Christ, if these things are not true; and if ye shall ask with a sincere heart, with real intent, having faith in Christ, he will manifest the truth of it unto you, by the power of the Holy Ghost.\nAnd by the power of the Holy Ghost ye may know the truth of all things."
    }
    }
  ]